<!DOCTYPE html><html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
   <meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width; initial-scale=1.0; maximum-scale=1.0; user-scalable=no"><title>UMI.Framework | umi\event</title><link rel="stylesheet" href="/assets/style.css"><link rel="stylesheet" href="/assets/highlight/styles/mono-blue.css"><script type="text/javascript" src="/assets/jquery-2.0.3.min.js"></script><script type="text/javascript" src="/assets/highlight/highlight.pack.js"></script><script type="text/javascript" src="/assets/layout.js"></script></head><body class="article"><div class="wrapper"><div class="header fixed"><div class="row umi-header-row"><nav class="top-bar" data-topbar=""><ul class="title-area"><li class="name"><h1><a href="/"><img src="/assets/logo.png"></a></h1></li><li class="toggle-topbar menu-icon"><a href=""><span>&#1052;&#1077;&#1085;&#1102;</span></a></li></ul><section class="top-bar-section"><ul class="left"><li><a href="/">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</a></li><li><a href="/documentation" class="active">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</a></li><li><a href="/contributing">&#1059;&#1095;&#1072;&#1089;&#1090;&#1080;&#1077; &#1074; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1080;</a></li></ul></section></nav></div></div><div class="body row"><div class="umi-side-nav columns small-4"><div class="menu article"><i class="pull-nav"></i><div><ul><li><a class="side-nav-anchor" href="event.html">umi\event</a><ul><li><a class="side-nav-anchor" href="event.html#d5e719">Введение</a></li><li><a class="side-nav-anchor" href="event.html#d5e751">Использование</a></li></ul></li></ul></div><div class="umi-to-top-button"><i class="fi-arrow-up small" title="&#1053;&#1072;&#1074;&#1077;&#1088;&#1093;"></i></div></div></div><div class="content columns small-12"><div class="umi-breadcrumbs"><span class="breadcrumb-link"><a href="../index.html">UMI.Framework</a></span> &gt; <span class="breadcrumb-link"><a href="index.html">&#1057;&#1087;&#1088;&#1072;&#1074;&#1086;&#1095;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</a></span> &gt; <span class="breadcrumb-node">umi\event</span></div><a class="right" title="&#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;" href="javascript:window.print(); void 0;"><i class="fi-print"></i></a><div class="article"><div><h1 class="title"><a name="d5e714"></a>umi\event</h1></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e719"></a>&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</h2></div></div></div><p>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; <code class="literal">umi\event</code> &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;&#1084;&#1080;, &#1086;&#1085;
            &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1080;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; <span class="bold"><strong>&#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;</strong></span>, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1080;
            &#1086;&#1090;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1090;&#1100; &#1076;&#1083;&#1103; &#1101;&#1090;&#1080;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; <span class="bold"><strong>&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080;</strong></span>.</p><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e725"></a>&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;</h3></div></div></div><p>&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1087;&#1086; &#1089;&#1091;&#1090;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1084;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1080; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103; &#1086;&#1087;&#1086;&#1074;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;
                &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086; &#1080;&#1083;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1074;&#1086;&#1096;&#1083;&#1072; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;. &#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;
                &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1093;&#1074;&#1072;&#1095;&#1077;&#1085;&#1086; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;&#1080;.</p><p>&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1074; <code class="literal">umi\event</code> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084;
                    <code class="interfacename">umi\event\IEvent</code>. </p><p>&#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1073;&#1099;&#1083; <span class="bold"><strong>&#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;</strong></span> &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; (&#1090;.&#1077;. &#1086; &#1090;&#1086;&#1084;, &#1075;&#1076;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086;), <span class="bold"><strong>&#1090;&#1080;&#1087;</strong></span>, &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081;, &#1082;&#1072;&#1082;&#1086;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086;, &#1072;
                &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; <span class="bold"><strong>&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</strong></span> &#1080; <span class="bold"><strong>&#1090;&#1077;&#1075;&#1080;</strong></span>. </p><p>&#1058;&#1080;&#1087; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093;
                &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100;
                &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1099;. &#1058;&#1077;&#1075;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1090;&#1080;&#1087;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1077;&#1077;
                &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1077;&#1075;&#1080;, &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1099; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080;,
                &#1090;&#1077;&#1075;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1089;&#1103; &#1074; &#1090;&#1077;&#1075;&#1072;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1073;&#1099;&#1083;
                &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1073;&#1077;&#1079; &#1090;&#1077;&#1075;&#1086;&#1074;, &#1090;&#1086; &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1076;&#1083;&#1103; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1089; &#1083;&#1102;&#1073;&#1099;&#1084;&#1080; &#1090;&#1077;&#1075;&#1072;&#1084;&#1080;.</p><p>&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086;&#1073; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;,
                &#1075;&#1076;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;, &#1080;&#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1084; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;.</p></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e738"></a>&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;</h3></div></div></div><p>&#1050;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; <code class="literal">umi\event</code> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; <span class="bold"><strong>&#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;</strong></span> -
                    <code class="interfacename">umi\event\IEventManager</code>. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;
                &#1093;&#1086;&#1095;&#1077;&#1090; &#1080;&#1085;&#1080;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1084;&#1077;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;.
                &#1048;&#1084;&#1077;&#1085;&#1085;&#1086; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1080;&#1084;&#1077;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1083;&#1103; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;, &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080;
                &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;. </p></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e744"></a>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;</h3></div></div></div><p>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; callable-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077;, &#1095;&#1090;&#1086;
                &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1089;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1101;&#1090;&#1086; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1076;&#1077;&#1090;. &#1055;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1077;&#1084;&#1091;
                &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1077;&#1076;&#1096;&#1077;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; <code class="interfacename">umi\event\IEvent</code>,
                &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1090;&#1086;&#1084;, &#1075;&#1076;&#1077;
                &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1086; &#1080; &#1089; &#1082;&#1072;&#1082;&#1080;&#1084;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084;&#1080;.</p><p>&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; <span class="bold"><strong>&#1094;&#1077;&#1087;&#1086;&#1095;&#1082;&#1080;
                    &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;</strong></span>, &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1103; &#1082; &#1089;&#1077;&#1073;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1099; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;. &#1055;&#1086;&#1089;&#1083;&#1077;
                &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1089;&#1074;&#1086;&#1080;&#1093; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;,
                &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1072;&#1093;.</p><p>&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1094;&#1077;&#1087;&#1086;&#1095;&#1082;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1077;&#1088;&#1074;&#1072;&#1090;&#1100; &#1094;&#1077;&#1087;&#1086;&#1095;&#1082;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080;
                &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1085;&#1077; &#1073;&#1099;&#1083;&#1080; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1099;.</p></div></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e751"></a>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</h2></div></div></div><p>&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1074; &#1079;&#1072;&#1082;&#1072;&#1079;&#1077;
            &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;-&#1084;&#1072;&#1075;&#1072;&#1079;&#1080;&#1085;&#1072;. &#1047;&#1072;&#1076;&#1072;&#1095;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;
            &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1090;&#1086;&#1074;&#1072;&#1088;&#1086;&#1074; &#1074; &#1079;&#1072;&#1082;&#1072;&#1079;&#1077; &#1080; &#1080;&#1093; &#1086;&#1073;&#1097;&#1091;&#1102; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077;
            &#1087;&#1077;&#1088;&#1077;&#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1103; &#1101;&#1090;&#1080; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072;
            &#1090;&#1086;&#1074;&#1072;&#1088;&#1072; &#1074; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;, &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1077;&#1081; &#1079;&#1072;&#1082;&#1072;&#1079;&#1091;, &#1079;&#1072;&#1082;&#1072;&#1079; &#1091;&#1079;&#1085;&#1072;&#1074;&#1072;&#1083; &#1086;&#1073; &#1101;&#1090;&#1080;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1093; &#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1083; &#1089;&#1074;&#1086;&#1102;
            &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;.</p><p>&#1050;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1085;&#1080;&#1094;&#1080;&#1088;&#1091;&#1102;&#1090; &#1080;&#1083;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;
                <code class="interfacename">umi\event\IEventObservant</code>. &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;
                <code class="interfacename">umi\event\IEventObservant</code> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1074; &#1090;&#1088;&#1077;&#1081;&#1090;&#1077;
                <code class="classname">umi\event\TEventObservant</code>.</p><p>&#1055;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1079;&#1072;&#1082;&#1072;&#1079;&#1072; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1090;&#1086;&#1074;&#1072;&#1088;&#1072; (&#1084;&#1077;&#1090;&#1086;&#1076;
                <code class="methodname">setQuantity()</code>) &#1080;&#1085;&#1080;&#1094;&#1080;&#1080;&#1088;&#1091;&#1077;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;
                <code class="option">OrderItemUpdateQuantity</code>, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1103; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;
            &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1077;&#1076;&#1096;&#1077;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072;. </p><p>&#1050;&#1086;&#1076; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1079;&#1072;&#1082;&#1072;&#1079;&#1072;:</p><pre class="programlisting">
use umi\event\IEventObservant;
use umi\event\TEventObservant;

/**
 * &#1055;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1079;&#1072;&#1082;&#1072;&#1079;&#1072;
 */
class OrderItem implements IEventObservant
{
    use TEventObservant;

    /**
     * @var string $name &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1074;&#1072;&#1088;&#1072;
     */
    private $name;
    /**
     * @var float $price &#1094;&#1077;&#1085;&#1072; &#1090;&#1086;&#1074;&#1072;&#1088;&#1072;
     */
    private $price;
    /**
     * @var int $quantity &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1086;&#1074;&#1072;&#1088;&#1072;
     */
    private $quantity = 0;

    /**
     * &#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;
     * @param $name &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
     * @param $price &#1094;&#1077;&#1085;&#1072;
     */
    public function __construct($name, $price)
    {
        $this-&gt;name = $name;
        $this-&gt;price = (float) $price;
    }

    /**
     * &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1094;&#1077;&#1085;&#1091; &#1090;&#1086;&#1074;&#1072;&#1088;&#1072;
     * @return float
     */
    public function getPrice()
    {
        return $this-&gt;price;
    }

    /**
     * &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1086;&#1074;&#1072;&#1088;&#1072;
     * @param int $quantity
     */
    public function setQuantity($quantity)
    {
        $quantity = (int) $quantity;
        if ($this-&gt;quantity != $quantity) {

            $this-&gt;fireEvent(
                'OrderItemUpdateQuantity',
                [
                    'quantityDelta' =&gt; $quantity - $this-&gt;quantity
                ]
            );

            $this-&gt;quantity = $quantity;
        }
    }
}
        </pre><p>&#1047;&#1072;&#1082;&#1072;&#1079; &#1087;&#1088;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1079;&#1072;&#1082;&#1072;&#1079;&#1072; (&#1084;&#1077;&#1090;&#1086;&#1076; <code class="methodname">appendItem()</code>)
            &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1101;&#1090;&#1086;&#1081; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; <code class="methodname">bindLocalEvents()</code>
            &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; "&#1089;&#1083;&#1091;&#1096;&#1072;&#1090;&#1100;" &#1079;&#1072;&#1082;&#1072;&#1079; &#1080; &#1082;&#1072;&#1082;&#1080;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;. &#1047;&#1072;&#1082;&#1072;&#1079;
            &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1090;&#1080;&#1087;&#1072; <code class="option">OrderItemUpdateQuantity</code>, &#1082;&#1086;&#1075;&#1076;&#1072; &#1101;&#1090;&#1086; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;
            &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;, &#1079;&#1072;&#1082;&#1072;&#1079; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086;&#1073; &#1086;&#1073;&#1097;&#1077;&#1084; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1090;&#1086;&#1074;&#1072;&#1088;&#1086;&#1074; &#1080; &#1080;&#1093; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;. </p><p>&#1050;&#1086;&#1076; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1079;&#1072;&#1082;&#1072;&#1079;&#1072;:</p><pre class="programlisting">
use umi\event\IEvent;
use umi\event\IEventObservant;
use umi\event\TEventObservant;

/**
 * &#1047;&#1072;&#1082;&#1072;&#1079;
 */
class Order implements IEventObservant
{
    use TEventObservant;

    /**
     * @var int $quantity &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1086;&#1074;&#1072;&#1088;&#1086;&#1074;
     */
    private $totalQuantity = 0;

    /**
     * @var float $totalPrice &#1089;&#1091;&#1084;&#1084;&#1072; &#1079;&#1072;&#1082;&#1072;&#1079;&#1072;
     */
    private $totalPrice = 0;

    /**
     * &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1074; &#1079;&#1072;&#1082;&#1072;&#1079;
     * @param OrderItem $item
     */
    public function appendItem(OrderItem $item)
    {
        $this-&gt;subscribeTo($item);
    }

    /**
     * &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1097;&#1077;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1086;&#1074;&#1072;&#1088;&#1086;&#1074; &#1074; &#1079;&#1072;&#1082;&#1072;&#1079;&#1077;
     * @return int
     */
    public function getTotalQuantity()
    {
        return $this-&gt;totalQuantity;
    }

    /**
     * &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1091;&#1084;&#1084;&#1072;&#1088;&#1085;&#1091;&#1102; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1079;&#1072;&#1082;&#1072;&#1079;&#1072;
     * @return float
     */
    public function getTotalPrice()
    {
        return $this-&gt;totalPrice;
    }

    /**
     * &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;
     * @return $this
     */
    protected function bindLocalEvents()
    {
       $this-&gt;bindEvent(
           'OrderItemUpdateQuantity',
           function (IEvent $event) {
               /**
                * @var OrderItem $orderItem
                */
               $orderItem = $event-&gt;getTarget();
               $quantityDelta = $event-&gt;getParam('quantityDelta');

               $this-&gt;totalQuantity += $quantityDelta;
               $this-&gt;totalPrice += ($orderItem-&gt;getPrice() * $quantityDelta);
           }
       );
    }
}
        </pre><p>&#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1084;&#1099; &#1093;&#1086;&#1090;&#1080;&#1084; &#1082;&#1091;&#1087;&#1080;&#1090;&#1100; &#1084;&#1086;&#1083;&#1086;&#1082;&#1086;. &#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1079;&#1072;&#1082;&#1072;&#1079; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084; &#1074; &#1085;&#1077;&#1075;&#1086; &#1084;&#1086;&#1083;&#1086;&#1082;&#1086; &#1087;&#1086; &#1094;&#1077;&#1085;&#1077;
            34,5 &#1088;&#1091;&#1073;&#1083;&#1103;. &#1055;&#1086;&#1076;&#1091;&#1084;&#1072;&#1077;&#1084; &#1080; &#1089;&#1082;&#1072;&#1078;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1090;&#1088;&#1080; &#1087;&#1072;&#1082;&#1077;&#1090;&#1072; &#1084;&#1086;&#1083;&#1086;&#1082;&#1072;. &#1042; &#1080;&#1090;&#1086;&#1075;&#1077; &#1086;&#1073;&#1097;&#1077;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;
            &#1090;&#1086;&#1074;&#1072;&#1088;&#1072; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; 3 &#1096;&#1090;&#1091;&#1082;&#1080;, &#1072; &#1086;&#1073;&#1097;&#1072;&#1103; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; - 103,5 &#1088;&#1091;&#1073;&#1083;&#1077;&#1081;.</p><pre class="programlisting">
$order = new Order();
$milkItem = new OrderItem('&#1052;&#1086;&#1083;&#1086;&#1082;&#1086;', '34.5');

$order-&gt;appendItem($milkItem);
$milkItem-&gt;setQuantity(3);

echo $order-&gt;getTotalQuantity() . PHP_EOL; //3
echo $order-&gt;getTotalPrice(); //103.5
       </pre></div></div><div class="disqus-area"><h2>&#1054;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;</h2><div id="disqus_thread"></div><script type="text/javascript">
        /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
        var disqus_shortname = 'umiframework'; // required: replace example with your forum shortname

        /* * * DON'T EDIT BELOW THIS LINE * * */
        (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
      </script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a></div></div><div class="for_footer"></div></div></div><div class="footer"><div class="umi-footer-row"><div class="row"><div class="columns small-12 medium-7"><div class="row"><div class="number columns small-12 medium-4"><div class="row"><span class="columns small-6 medium-12">&#1057;&#1072;&#1085;&#1082;&#1090;-&#1055;&#1077;&#1090;&#1077;&#1088;&#1073;&#1091;&#1088;&#1075;</span><span class="columns small-6 medium-12">+7(812)309-03-15</span></div></div><div class="number columns small-12 medium-4"><div class="row"><span class="columns small-6 medium-12">&#1052;&#1086;&#1089;&#1082;&#1074;&#1072;</span><span class="columns small-6 medium-12">+7(495)662-87-59</span></div></div><div class="number columns small-12 medium-4"><div class="row"><span class="columns small-6 medium-12">&#1041;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1081; &#1079;&#1074;&#1086;&#1085;&#1086;&#1082;</span><span class="columns small-6 medium-12">8-800-5555-864</span></div></div></div></div><div class="columns small-12 medium-5"><ul class="list-social"><li><div class="fb-like" data-href="http://umi-framework.ru/" data-layout="button_count" data-action="like" data-show-faces="true" data-share="false"></div><div id="fb-root"></div><script>(function (d, s, id) {
                  var js, fjs = d.getElementsByTagName(s)[0];
                  if (d.getElementById(id)) return;
                  js = d.createElement(s);
                  js.id = id;
                  js.src = "//connect.facebook.net/ru_RU/all.js#xfbml=1";
                  fjs.parentNode.insertBefore(js, fjs);
                  }(document, 'script', 'facebook-jssdk'));</script></li><li><script type="text/javascript" src="//vk.com/js/api/openapi.js?105"></script><script type="text/javascript">
                  VK.init({apiId: 4050456, onlyWidgets: true});
                </script><div id="vk_like"></div><script type="text/javascript">
                  VK.Widgets.Like("vk_like", {type: "mini"});
                </script></li><li class="twtr"><a href="https://twitter.com/share" class="twitter-share-button" data-lang="ru" data-dnt="true">&#1058;&#1074;&#1080;&#1090;&#1085;&#1091;&#1090;&#1100;</a><script>!function (d, s, id) {
                  var js, fjs = d.getElementsByTagName(s)[0], p = /^http:/.test(d.location) ? 'http' : 'https';
                  if (!d.getElementById(id)) {
                  js = d.createElement(s);
                  js.id = id;
                  js.src = p + '://platform.twitter.com/widgets.js';
                  fjs.parentNode.insertBefore(js, fjs);
                  }
                  }(document, 'script', 'twitter-wjs');</script></li><li><iframe src="http://ghbtns.com/github-btn.html?user=Umisoft&amp;repo=umi-framework&amp;type=watch&amp;count=true" allowtransparency="true" frameborder="0" scrolling="0" width="72" height="20"></iframe></li></ul></div></div><div class="row"><div class="columns small-12"><div class="copyright right">&copy; &#1054;&#1054;&#1054; &laquo;&#1070;&#1084;&#1080;&#1089;&#1086;&#1092;&#1090;&raquo; 2007-2013</div></div></div></div></div><script type="text/javascript" src="/assets/foundation.min.js"></script></body></html>