<!DOCTYPE html><html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
   <meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width; initial-scale=1.0; maximum-scale=1.0; user-scalable=no"><title>UMI.Framework | umi\session</title><link rel="stylesheet" href="/assets/style.css"><link rel="stylesheet" href="/assets/highlight/styles/mono-blue.css"><script type="text/javascript" src="/assets/jquery-2.0.3.min.js"></script><script type="text/javascript" src="/assets/highlight/highlight.pack.js"></script><script type="text/javascript" src="/assets/layout.js"></script></head><body class="article"><div class="wrapper"><div class="header fixed"><div class="row umi-header-row"><nav class="top-bar" data-topbar=""><ul class="title-area"><li class="name"><h1><a href="/"><img src="/assets/logo.png"></a></h1></li><li class="toggle-topbar menu-icon"><a href=""><span>&#1052;&#1077;&#1085;&#1102;</span></a></li></ul><section class="top-bar-section"><ul class="left"><li><a href="/">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</a></li><li><a href="/documentation" class="active">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</a></li><li><a href="/contributing">&#1059;&#1095;&#1072;&#1089;&#1090;&#1080;&#1077; &#1074; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1080;</a></li><li><a href="/download.html">&#1057;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100;<i class="icon save right"></i></a></li></ul></section></nav></div></div><div class="body row"><div class="umi-side-nav columns small-4"><div class="menu article"><i class="pull-nav"></i><div><ul><li><a class="side-nav-anchor" href="session.html">umi\session</a><ul><li><a class="side-nav-anchor" href="session.html#d5e2315">Введение</a></li><li><a class="side-nav-anchor" href="session.html#d5e2337">Базовое использование</a></li><li><a class="side-nav-anchor" href="session.html#d5e2351">Расширенное использование</a></li></ul></li></ul></div><div class="umi-to-top-button"><i class="fi-arrow-up small" title="&#1053;&#1072;&#1074;&#1077;&#1088;&#1093;"></i></div></div></div><div class="content columns small-12"><div class="umi-breadcrumbs"><span class="breadcrumb-link"><a href="../index.html">UMI.Framework</a></span> &gt; <span class="breadcrumb-link"><a href="index.html">&#1057;&#1087;&#1088;&#1072;&#1074;&#1086;&#1095;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</a></span> &gt; <span class="breadcrumb-node">umi\session</span></div><a class="right" title="&#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;" href="javascript:window.print(); void 0;"><i class="fi-print"></i></a><div class="article"><div><h1 class="title"><a name="d5e2310"></a>umi\session</h1></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e2315"></a>&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</h2></div></div></div><p>&#1052;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084; &#1089;&#1077;&#1089;&#1089;&#1080;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1072;&#1078;&#1085;&#1099;&#1084; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1086;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; Web &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1054;&#1085; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;
            &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;, &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1087;&#1086;&#1089;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080;&#1084; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;. &#1057;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; web
            &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1084;&#1099;&#1089;&#1083;&#1080;&#1084;&#1099; &#1073;&#1077;&#1079; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1077;&#1089;&#1089;&#1080;&#1081;. &#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077; &#1087;&#1088;&#1086; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1074;
                <a class="link" href="http://www.php.net/manual/book.session.php" target="_top">&#1086;&#1092;.
                &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;</a>.</p><p>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; <code class="literal">umi\session</code> &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1091; API &#1076;&#1083;&#1103;
            &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1086;&#1084; &#1089;&#1077;&#1089;&#1089;&#1080;&#1081;. &#1054;&#1085; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1086;&#1090;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077;
            &#1088;&#1072;&#1079;&#1073;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1085;&#1072; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;
                &#1080;&#1084;&#1077;&#1085; (<code class="literal">umi\session\ISessionNamespace</code>. &#1044;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;
            &#1080;&#1084;&#1077;&#1085; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1080;&#1090;&#1100; &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1094;&#1080;&#1102; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1080;&#1083;&#1080; &#1087;&#1086; User Agent &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;),
            &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; <code class="literal">umi\session\validator\ISessionValidator</code>.
            &#1053;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1091;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1087;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1091;, &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1102; &#1080; &#1090;.&#1087;. &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; -
                <code class="literal">umi\session\ISessionManager</code>.</p><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e2324"></a>&#1054;&#1090;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;</h3></div></div></div><p>&#1050;&#1072;&#1082; &#1073;&#1099;&#1083;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074;&#1099;&#1096;&#1077;, &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1083;&#1077;&#1085;&#1080;&#1074;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086; &#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;
                &#1085;&#1072; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;.</p><p>&#1055;&#1088;&#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1079;&#1072;&#1093;&#1086;&#1076;&#1077; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;, &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;. &#1042; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;,
                &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072; &#1076;&#1086; &#1090;&#1086;&#1075;&#1086; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1087;&#1086;&#1082;&#1072; &#1074; &#1085;&#1077;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1086;&#1076;&#1085;&#1086;
                &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074; &#1080;&#1084;&#1077;&#1085; &#1074; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;
                &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;. &#1057;&#1077;&#1089;&#1089;&#1080;&#1103; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077;
                &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085; &#1080;&#1083;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1084;&#1077;&#1085; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1088;&#1080;
                &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088;&#1072;).</p><p>&#1042; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1086;&#1089;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1073;&#1099;&#1083;&#1072; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072;, &#1090;&#1086; &#1086;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090;
                &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; (&#1090;.&#1077;. &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1089;&#1103;).</p></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e2329"></a>&#1055;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;</h3></div></div></div><p>&#1044;&#1083;&#1103; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085;. &#1054;&#1085;&#1080;
                &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; &#1085;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;, &#1095;&#1090;&#1086; &#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;
                &#1082;&#1086;&#1085;&#1092;&#1083;&#1080;&#1082;&#1090;&#1086;&#1074; &#1080;&#1084;&#1077;&#1085; &#1080; &#1076;&#1088;.</p><p>&#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1084;&#1077;&#1085; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1083;&#1103;&#1077;&#1090; &#1080;&#1079; &#1089;&#1077;&#1073;&#1103; &#1089;&#1086;&#1074;&#1086;&#1082;&#1091;&#1087;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;
                &#1080;&#1084;&#1077;&#1085; &#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1052;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1076;&#1083;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1085;&#1077;
                &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099;&#1093; &#1074; &#1085;&#1080;&#1093;. &#1044;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085;, &#1085;&#1072;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;,
                &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086;, &#1076;&#1086; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1085;&#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1094;&#1080;&#1080; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;.</p><p>&#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1084;&#1077;&#1085; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086;, &#1087;&#1077;&#1088;&#1077;&#1076;
                &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;. &#1055;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1084;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085; &#1080; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1077;&#1075;&#1086;
                &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;.</p></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e2334"></a>&#1042;&#1072;&#1083;&#1080;&#1076;&#1072;&#1094;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;</h3></div></div></div><p>&#1051;&#1102;&#1073;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1084;&#1077;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1072;&#1073;&#1086;&#1088; &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;, &#1086;&#1085;&#1080; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;
                &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085;. &#1055;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085; &#1086;&#1085;&#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103;
                &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1074;&#1086;&#1080;&#1093; &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1077;&#1089;&#1083;&#1080; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1086;&#1076;&#1080;&#1085; &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088; &#1085;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090;,
                &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1084;&#1077;&#1085; &#1086;&#1095;&#1080;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103;.</p></div></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e2337"></a>&#1041;&#1072;&#1079;&#1086;&#1074;&#1086;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</h2></div></div></div><div class="alert-box important"><h3 class="title">&#1042;&#1072;&#1078;&#1085;&#1086;</h3><i class="fi-info"></i><p>&#1055;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; <code class="literal">umi\session</code> &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;
                &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1081; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103;
                &#1073;&#1091;&#1076;&#1077;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072;.</p></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e2342"></a>&#1055;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085;</h3></div></div></div><p>&#1055;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1077;&#1084; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1084;&#1077;&#1085; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1074; &#1085;&#1077;&#1075;&#1086;
                &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;:</p><pre class="programlisting">$sampleNs = $session
    -&gt;registerNamespace('sample')
    -&gt;getNamespace('sample');

var_dump($session-&gt;hasNamespace('sample')); // &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090; true

$sampleNs['key'] = 'value'; //&#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1084;&#1077;&#1085;
var_dump($sampleNs-&gt;toArray());</pre></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e2346"></a>&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;</h3></div></div></div><p>&#1052;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1081; &#1089; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;&#1084; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;. &#1050;&#1072;&#1082; &#1091;&#1078;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1086;&#1089;&#1100; &#1074;&#1099;&#1096;&#1077;,
                &#1089;&#1090;&#1072;&#1088;&#1090; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;, &#1087;&#1086; &#1101;&#1090;&#1086;&#1084;&#1091;, &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1074;&#1072;&#1084;
                &#1085;&#1077; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1091; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;. &#1053;&#1086;, &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086;
                &#1087;&#1088;&#1080;&#1085;&#1091;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102; &#1080;&#1083;&#1080; &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1080;&#1090;&#1100; &#1077;&#1105;, &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103;
                &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;.</p><p>&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1072; &#1089;&#1077;&#1089;&#1089;&#1080;&#1081;:</p><pre class="programlisting">var_dump($sessionManager-&gt;start());
var_dump($sessionManager-&gt;destroy());
var_dump($sessionManager-&gt;destroy());</pre></div></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e2351"></a>&#1056;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1086;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</h2></div></div></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e2353"></a>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;</h3></div></div></div><p>&#1055;&#1088;&#1080; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;. &#1050;
                &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;:</p><pre class="programlisting">$session-&gt;registerNamespace(
        'sample',
        [
            ISessionValidator::LIFE_TIME =&gt; 60
        ]
    );</pre><p>&#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1084;&#1077;&#1085; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1089; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;
                &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1078;&#1080;&#1079;&#1085;&#1080; &#1074; 60 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;. &#1069;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1074;&#1080;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074;
                &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; 60 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1074;&#1086; &#1080;&#1084;&#1077;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1077;&#1085;&#1086;.</p></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e2358"></a>&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088;&#1099;</h3></div></div></div><div class="variablelist"><dl class="variablelist"><dt><span class="term"><code class="literal">ISessionValidator::TYPE_LIFE_TIME</code> =&gt; <span class="bold"><strong>TIME</strong></span></span></dt><dd><p>&#1042;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1087;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086;
                            &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1082; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1091; &#1085;&#1077; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1083;&#1080;&#1089;&#1100; <span class="bold"><strong>TIME</strong></span> &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1090;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090;
                            &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1077;&#1085;&#1099;.</p></dd><dt><span class="term"><code class="literal">ISessionValidator::TYPE_USER_AGENT</code></span></dt><dd><p>&#1042;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1084;&#1077;&#1085; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1087;&#1086; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1091;
                            "User-Agent" &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1074;&#1072;&#1083;&#1080;&#1076;&#1072;&#1090;&#1086;&#1088; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1079;&#1072;&#1097;&#1080;&#1090;&#1091; &#1086;&#1090; &#1072;&#1090;&#1072;&#1082;&#1080;
                            &#1085;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1087;&#1091;&#1090;&#1077;&#1084; &#1082;&#1088;&#1072;&#1078;&#1080; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;.</p></dd></dl></div></div></div></div><div class="disqus-area"><h2>&#1054;&#1073;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;</h2><div id="disqus_thread"></div><script type="text/javascript">
        /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
        var disqus_shortname = 'umiframework'; // required: replace example with your forum shortname

        /* * * DON'T EDIT BELOW THIS LINE * * */
        (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
      </script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a></div></div><div class="for_footer"></div></div></div><div class="footer"><div class="umi-footer-row"><div class="row"><div class="columns small-12 medium-7"><div class="row"><div class="number columns small-12 medium-4"><div class="row"><span class="columns small-6 medium-12">&#1057;&#1072;&#1085;&#1082;&#1090;-&#1055;&#1077;&#1090;&#1077;&#1088;&#1073;&#1091;&#1088;&#1075;</span><span class="columns small-6 medium-12">+7(812)309-03-15</span></div></div><div class="number columns small-12 medium-4"><div class="row"><span class="columns small-6 medium-12">&#1052;&#1086;&#1089;&#1082;&#1074;&#1072;</span><span class="columns small-6 medium-12">+7(495)662-87-59</span></div></div><div class="number columns small-12 medium-4"><div class="row"><span class="columns small-6 medium-12">&#1041;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1081; &#1079;&#1074;&#1086;&#1085;&#1086;&#1082;</span><span class="columns small-6 medium-12">8-800-5555-864</span></div></div></div></div><div class="columns small-12 medium-5"><ul class="list-social"><li><div class="fb-like" data-href="http://umi-framework.ru/" data-layout="button_count" data-action="like" data-show-faces="true" data-share="false"></div><div id="fb-root"></div><script>(function (d, s, id) {
                  var js, fjs = d.getElementsByTagName(s)[0];
                  if (d.getElementById(id)) return;
                  js = d.createElement(s);
                  js.id = id;
                  js.src = "//connect.facebook.net/ru_RU/all.js#xfbml=1";
                  fjs.parentNode.insertBefore(js, fjs);
                  }(document, 'script', 'facebook-jssdk'));</script></li><li><script type="text/javascript" src="//vk.com/js/api/openapi.js?105"></script><script type="text/javascript">
                  VK.init({apiId: 4050456, onlyWidgets: true});
                </script><div id="vk_like"></div><script type="text/javascript">
                  VK.Widgets.Like("vk_like", {type: "mini"});
                </script></li><li class="twtr"><a href="https://twitter.com/share" class="twitter-share-button" data-lang="ru" data-dnt="true">&#1058;&#1074;&#1080;&#1090;&#1085;&#1091;&#1090;&#1100;</a><script>!function (d, s, id) {
                  var js, fjs = d.getElementsByTagName(s)[0], p = /^http:/.test(d.location) ? 'http' : 'https';
                  if (!d.getElementById(id)) {
                  js = d.createElement(s);
                  js.id = id;
                  js.src = p + '://platform.twitter.com/widgets.js';
                  fjs.parentNode.insertBefore(js, fjs);
                  }
                  }(document, 'script', 'twitter-wjs');</script></li><li><iframe src="http://ghbtns.com/github-btn.html?user=Umisoft&amp;repo=umi-framework&amp;type=watch&amp;count=true" allowtransparency="true" frameborder="0" scrolling="0" width="72" height="20"></iframe></li></ul></div></div><div class="row"><div class="columns small-12"><div class="copyright right">&copy; &#1054;&#1054;&#1054; &laquo;&#1070;&#1084;&#1080;&#1089;&#1086;&#1092;&#1090;&raquo; 2007-2014</div></div></div></div></div><script type="text/javascript" src="/assets/foundation.min.js"></script><script type="text/javascript">
              var _gaq = _gaq || [];
              _gaq.push(['_setAccount', 'UA-46789107-1']);
              _gaq.push(['_trackPageview']);

              (function() {
              var ga = document.createElement('script'); ga.type =

              'text/javascript'; ga.async = true;
              ga.src = ('https:' == document.location.protocol ? 'https://ssl' :

              'http://www') + '.google-analytics.com/ga.js';
              var s = document.getElementsByTagName('script')[0];

              s.parentNode.insertBefore(ga, s);
              })();
          </script></body></html>