<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
   <meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width; initial-scale=1.0; maximum-scale=1.0; user-scalable=no"><title>UMI.Framework | umi\config</title><link rel="stylesheet" href="/assets/style.css"><link rel="stylesheet" href="/assets/highlight/styles/mono-blue.css"><script type="text/javascript" src="/assets/jquery-2.0.3.min.js"></script><script type="text/javascript" src="/assets/highlight/highlight.pack.js"></script><script type="text/javascript" src="/assets/layout.js"></script></head><body><div class="wrapper"><div class="header fixed"><div class="row"><div class="columns small-3 large-4"><a href="/" title="&#1042; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;" class="logo"><img src="/assets/logo.png"></a></div><div class="columns small-9 large-8"><div class="menu"><a href="/">&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;</a><a href="/documentation" class="active">&#1044;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</a><a href="#" class="disabled">&#1059;&#1095;&#1072;&#1089;&#1090;&#1080;&#1077; &#1074; &#1088;&#1072;&#1079;&#1074;&#1080;&#1090;&#1080;&#1080;</a></div></div></div></div><div class="body row"><div class="side-nav columns small-4"><div class="menu article"><i class="pull-nav"></i><ul><li><a class="side-nav-anchor" href="ar11.html">umi\config</a><ul><li><a class="side-nav-anchor" href="ar11.html#d5e612">Введение</a></li><li><a class="side-nav-anchor" href="ar11.html#d5e622">Конфигурация</a></li><li><a class="side-nav-anchor" href="ar11.html#d5e640">I/O сервис конфигурации</a></li><li><a class="side-nav-anchor" href="ar11.html#d5e658">Форматы конфигурационных файлов</a></li></ul></li></ul></div></div><div class="content columns small-12"><div class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">UMI.Framework</a></span> &gt; <span class="breadcrumb-link"><a href="pt02.html">&#1057;&#1087;&#1088;&#1072;&#1074;&#1086;&#1095;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</a></span> &gt; <span class="breadcrumb-node">umi\config</span></div><div class="article"><div><h1 class="title"><a name="d5e607"></a>umi\config</h1></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e612"></a>&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;</h2></div></div></div><p>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; <code class="literal">umi\config</code> &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; &#1080;
            &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1102; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1086;&#1081;
            &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081;.</p><p>&#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; <code class="literal">umi\config</code> &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091;
            &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;. &#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102;. &#1043;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103;
            &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1084;, &#1086;&#1085;&#1072; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1072; &#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;,
            &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077;, &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1080;&#1079;
            &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074;, &#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1076;&#1083;&#1103; &#1085;&#1080;&#1093; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;
            &#1041;&#1044;).</p><p>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; <code class="literal">umi\config</code> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1102; &#1085;&#1072;
            &#1095;&#1072;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1083;&#1077;&#1085;&#1080;&#1074;&#1086;. &#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1080;&#1079; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;
            &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072; &#1074; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;.</p><div class="important"><table border="0" summary="Important"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Important]" src="/assets/images/important.png"></td><th><h3>&#1042;&#1072;&#1078;&#1085;&#1086;</h3></th></tr><tr><td align="left" valign="top"><p>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1092;&#1072;&#1081;&#1083;&#1099; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1097;&#1080;&#1084; &#1076;&#1083;&#1103; master &#1080; local
                    &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1081; &#1080; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; master &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081;.</p></td></tr></table></div></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e622"></a>&#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103;</h2></div></div></div><p>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; <code class="literal">umi\config</code> &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;
                <code class="literal">umi\config\entity\IConfig</code> &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081;.</p><p><code class="literal">umi\config\entity\IConfig</code> &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; 2&#1093; &#1090;&#1080;&#1087;&#1086;&#1074;:
            &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080; &#1084;&#1072;&#1089;&#1090;&#1077;&#1088;. &#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1084;&#1091;
            &#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1102;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1078;&#1077; &#1084;&#1072;&#1089;&#1090;&#1077;&#1088; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
            &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1076;&#1086; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074;
            &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1102;, &#1090;.&#1077;. &#1085;&#1077; &#1082;&#1101;&#1096;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;.</p><p><code class="literal">umi\config\entity\IConfig</code> &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;,
            &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1073;&#1088;&#1086;&#1089;&#1072; &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1080; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086;
            &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1087;&#1091;&#1090;&#1080;. &#1055;&#1091;&#1090;&#1100; &#1076;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1081; &#1080;&#1079; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084;
                <code class="literal">umi\config\entity\IConfig::PATH_SEPARATOR = '/'</code>.</p><p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081;:</p><pre class="programlisting">$config = $configIO-&gt;read('~/config.php');

var_dump($config['key']);

$config['key'] = 'Hello world';
var_dump($config['key']); // string(11) "Hello world"

var_dump($config['subconfig/subkey1']);</pre><p>&#1044;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1090;&#1072;&#1082; &#1080; &#1089;
            &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <code class="literal">\ArrayAccess</code>.</p><p>&#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072; &#1074; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;
                <code class="literal">toArray</code>, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074;&#1089;&#1077; &#1083;&#1077;&#1085;&#1080;&#1074;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084;&#1099;&#1077; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1099;.</p><div class="warning"><table border="0" summary="Warning"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Warning]" src="/assets/images/warning.png"></td><th><h3>&#1055;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1077;&#1088;&#1077;&#1078;&#1077;&#1085;&#1080;&#1077;</h3></th></tr><tr><td align="left" valign="top"><p>&#1044;&#1083;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1081; &#1085;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;,
                    &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1085;&#1077;&#1075;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086; &#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081;
                    &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;.</p></td></tr></table></div></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e640"></a>I/O &#1089;&#1077;&#1088;&#1074;&#1080;&#1089; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;</h2></div></div></div><p>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; <code class="literal">umi\config</code> &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089; &#1076;&#1083;&#1103; I/O &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1089;
            &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080;. &#1069;&#1090;&#1086;&#1090; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090;:</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem"><p>&#1055;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1102;</p></li><li class="listitem"><p>&#1047;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1102;</p></li></ul></div><p>I/O &#1089;&#1077;&#1088;&#1074;&#1080;&#1089; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089; <span class="bold"><strong>&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080;
                &#1080;&#1084;&#1077;&#1085;&#1072;&#1084;&#1080;</strong></span>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1085;&#1077;&#1084;. &#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1084;&#1103;
            &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1080;&#1084;&#1103; master &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1080;, &#1086;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;, &#1085;&#1072; &#1080;&#1084;&#1103; local &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;.
            &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1088;&#1072;&#1079;&#1091; &#1085;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;
            - local &#1080; master. &#1042;&#1089;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074;&#1074;&#1086;&#1076;&#1072;/&#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1103;&#1090; &#1087;&#1086; &#1077;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;&#1091; &#1080;&#1084;&#1077;&#1085;&#1080;.</p><div class="tip"><table border="0" summary="Tip"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Tip]" src="/assets/images/tip.png"></td><th><h3>&#1055;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072;</h3></th></tr><tr><td align="left" valign="top"><p>&#1044;&#1083;&#1103; &#1103;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1081; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1090;&#1100; &#1089; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;
                    "~"</p></td></tr></table></div><p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080;&#1084;&#1077;&#1085; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1081;:</p><pre class="programlisting">$configIO-&gt;registerAlias('~', __DIR__ . '/config/master', __DIR__ . '/config/local');
$configIO-&gt;registerAlias('~/application', __DIR__ . '/appconfig/master', __DIR__ . '/appconfig/local');</pre><p>&#1055;&#1088;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; master &#1080; local &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093;
            &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.</p><p>&#1047;&#1072;&#1087;&#1080;&#1089;&#1100; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.
            &#1057;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; master &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;,
            &#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080;.</p><p>&#1057;&#1077;&#1088;&#1074;&#1080;&#1089; I/O &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1101;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1072;&#1103;
            &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; "&#1089;&#1077;&#1088;&#1080;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;" &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1092;&#1072;&#1081;&#1083;, &#1087;&#1088;&#1080; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1084; &#1095;&#1090;&#1077;&#1085;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089;&#1083;&#1080;&#1103;&#1085;&#1080;&#1103;
            &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080; &#1084;&#1072;&#1089;&#1090;&#1077;&#1088; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1081; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;. &#1051;&#1077;&#1085;&#1080;&#1074;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084;&#1099;&#1077; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;
            &#1082;&#1101;&#1096;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093;, &#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1103; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1083;&#1080;&#1096;&#1085;&#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;
            &#1087;&#1088;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; &#1080;&#1079; &#1082;&#1101;&#1096;&#1072;.</p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e658"></a>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h2></div></div></div><p>&#1042;&#1089;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;.
            &#1063;&#1072;&#1089;&#1090;&#1080; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074;:</p><div class="variablelist"><dl class="variablelist"><dt><span class="term"><code class="literal">umi\config\io\reader\IReader::COMMAND_PART</code></span></dt><dd><p>&#1063;&#1072;&#1089;&#1090;&#1100; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;. &#1047;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089;
                        &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081;.</p></dd><dt><span class="term"><code class="literal">umi\config\io\reader\IReader::COMMAND_LAZY</code></span></dt><dd><p>&#1051;&#1077;&#1085;&#1080;&#1074;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;.</p></dd></dl></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e672"></a>PHP</h3></div></div></div><p>&#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1079; &#1089;&#1077;&#1073;&#1103; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084;
                &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074; &#1101;&#1090;&#1086;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1092;&#1072;&#1081;&#1083;, &#1089;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;
                &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1099;&#1084;:</p><pre class="programlisting"><span class="hl-directive" style="color: maroon">&lt;?php</span>
<strong class="hl-keyword">return</strong> [
    <strong class="hl-string"><em style="color:red">'key'</em></strong> =&gt; <strong class="hl-string"><em style="color:red">'value'</em></strong>
];</pre><p>&#1044;&#1083;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; <span class="bold"><strong>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;</strong></span>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;:
                    <span class="command"><strong>'{#&lt;type&gt;:&lt;file&gt;}'</strong></span>, &#1075;&#1076;&#1077; <span class="command"><strong>&lt;type&gt;</strong></span> -
                &#1090;&#1080;&#1087; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1072; <span class="command"><strong>&lt;file&gt;</strong></span> - &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080;&#1084;&#1103;
                &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1084;&#1086;&#1081; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;:</p><pre class="programlisting">&lt;?php
return [
    'components'  =&gt; [
        'component1'     =&gt; '{#partial:~/components/component1.config.php}',
        'component2'     =&gt; '{#lazy:~/components/component2.config.php}',
        'component3'     =&gt; '{#lazy:~/components/component3.config.php}',
    ],
];</pre></div></div></div><div class="umi-siblings-nav"><a class="arrow prev" href="ar10.html"><i class="icon prev"></i>umi\authentication</a><a class="arrow next" href="ar12.html">umi\filter<i class="icon next"></i></a></div><div id="disqus_thread"></div><script type="text/javascript">
      /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
      var disqus_shortname = 'umiframework'; // required: replace example with your forum shortname

      /* * * DON'T EDIT BELOW THIS LINE * * */
      (function() {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
      })();
    </script><noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript><a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a></div><div class="for_footer"></div></div></div><div class="footer"><div class="row"><div class="columns small-12 medium-8"><div class="row"><div class="number columns small-12 medium-4"><div class="row"><span class="columns small-6 medium-12">&#1057;&#1072;&#1085;&#1082;&#1090;-&#1055;&#1077;&#1090;&#1077;&#1088;&#1073;&#1091;&#1088;&#1075;</span><span class="columns small-6 medium-12">+7(812)309-03-15</span></div></div><div class="number columns small-12 medium-4"><div class="row"><span class="columns small-6 medium-12">&#1052;&#1086;&#1089;&#1082;&#1074;&#1072;</span><span class="columns small-6 medium-12">+7(495)662-87-59</span></div></div><div class="number columns small-12 medium-4"><div class="row"><span class="columns small-6 medium-12">&#1041;&#1077;&#1089;&#1087;&#1083;&#1072;&#1090;&#1085;&#1099;&#1081; &#1079;&#1074;&#1086;&#1085;&#1086;&#1082;</span><span class="columns small-6 medium-12">8-800-5555-864</span></div></div></div></div><div class="columns small-12 medium-4"><div class="right"><div class="fb-like" data-href="http://umi-framework.ru/" data-layout="button_count" data-action="like" data-show-faces="true" data-share="false"></div><div id="fb-root"></div><script>(function(d, s, id) {
              var js, fjs = d.getElementsByTagName(s)[0];
              if (d.getElementById(id)) return;
              js = d.createElement(s); js.id = id;
              js.src = "//connect.facebook.net/ru_RU/all.js#xfbml=1";
              fjs.parentNode.insertBefore(js, fjs);
              }(document, 'script', 'facebook-jssdk'));</script><script type="text/javascript" src="//vk.com/js/api/openapi.js?105"></script><script type="text/javascript">
              VK.init({apiId: 4050456, onlyWidgets: true});
            </script><div id="vk_like"></div><script type="text/javascript">
              VK.Widgets.Like("vk_like", {type: "button"});
            </script></div></div></div><div class="row"><div class="columns small-12"><div class="right copyright">&copy; &#1054;&#1054;&#1054; &laquo;&#1070;&#1084;&#1080;&#1089;&#1086;&#1092;&#1090;&raquo; 2007-2013</div></div></div></div></body></html>